<?php

namespace Tests;

use XiaoHua\Area\AreaFacade;

/**
 * @desc:
 * @author: 小花
 * @email: once_emails@163.com
 * @date: 2025/7/4
 * @createtime: 20:32
 */
class AreaUtilsTest extends AbstractTest
{

    /**
     * @covers \XiaoHua\Area\AreaFacade::get
     */
    public function testGetArea()
    {
        $res = AreaFacade::get(110000);
        $this->assertEquals([
            "id" => 110000,
            "name" => "北京市",
            "type" => 2,
            "parent_id" => 1,
            'children' => [
                [
                    "id" => 110100,
                    "name" => "北京市",
                    "type" => 3,
                    "parent_id" => 110000,
                    'children' => [
                        [
                            "id" => 110101,
                            "name" => "东城区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110102,
                            "name" => "西城区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110105,
                            "name" => "朝阳区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110106,
                            "name" => "丰台区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110107,
                            "name" => "石景山区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110108,
                            "name" => "海淀区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110109,
                            "name" => "门头沟区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110111,
                            "name" => "房山区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110112,
                            "name" => "通州区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110113,
                            "name" => "顺义区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110114,
                            "name" => "昌平区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110115,
                            "name" => "大兴区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110116,
                            "name" => "怀柔区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110117,
                            "name" => "平谷区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110118,
                            "name" => "密云区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ], [
                            "id" => 110119,
                            "name" => "延庆区",
                            "type" => 4,
                            "parent_id" => 110100,
                            'children' => []
                        ]
                    ]
                ]
            ]
        ], $res);
    }

    /**
     * @covers \XiaoHua\Area\AreaFacade::parse
     */
    public function testParseArea()
    {
        $res = AreaFacade::parse('河北省/石家庄市/长安区');
        $this->assertEquals([
            "id" => 130102,
            "name" => "长安区",
            "type" => 4,
            "parent_id" => 130100,
            'children' => []
        ], $res);
    }

    /**
     * @covers \XiaoHua\Area\AreaFacade::path
     */
    public function testGetAreaPath()
    {
        $res = AreaFacade::path([AreaFacade::get(410000)]);
        $this->assertEquals([
            "河南省",
            "河南省/郑州市",
            "河南省/郑州市/中原区",
            "河南省/郑州市/二七区",
            "河南省/郑州市/管城回族区",
            "河南省/郑州市/金水区",
            "河南省/郑州市/上街区",
            "河南省/郑州市/惠济区",
            "河南省/郑州市/中牟县",
            "河南省/郑州市/郑州经济技术开发区",
            "河南省/郑州市/郑州高新技术产业开发区",
            "河南省/郑州市/郑州航空港经济综合实验区",
            "河南省/郑州市/巩义市",
            "河南省/郑州市/荥阳市",
            "河南省/郑州市/新密市",
            "河南省/郑州市/新郑市",
            "河南省/郑州市/登封市",
            "河南省/开封市",
            "河南省/开封市/龙亭区",
            "河南省/开封市/顺河回族区",
            "河南省/开封市/鼓楼区",
            "河南省/开封市/禹王台区",
            "河南省/开封市/祥符区",
            "河南省/开封市/杞县",
            "河南省/开封市/通许县",
            "河南省/开封市/尉氏县",
            "河南省/开封市/兰考县",
            "河南省/洛阳市",
            "河南省/洛阳市/老城区",
            "河南省/洛阳市/西工区",
            "河南省/洛阳市/瀍河回族区",
            "河南省/洛阳市/涧西区",
            "河南省/洛阳市/偃师区",
            "河南省/洛阳市/孟津区",
            "河南省/洛阳市/洛龙区",
            "河南省/洛阳市/新安县",
            "河南省/洛阳市/栾川县",
            "河南省/洛阳市/嵩县",
            "河南省/洛阳市/汝阳县",
            "河南省/洛阳市/宜阳县",
            "河南省/洛阳市/洛宁县",
            "河南省/洛阳市/伊川县",
            "河南省/洛阳市/洛阳高新技术产业开发区",
            "河南省/平顶山市",
            "河南省/平顶山市/新华区",
            "河南省/平顶山市/卫东区",
            "河南省/平顶山市/石龙区",
            "河南省/平顶山市/湛河区",
            "河南省/平顶山市/宝丰县",
            "河南省/平顶山市/叶县",
            "河南省/平顶山市/鲁山县",
            "河南省/平顶山市/郏县",
            "河南省/平顶山市/平顶山高新技术产业开发区",
            "河南省/平顶山市/平顶山市城乡一体化示范区",
            "河南省/平顶山市/舞钢市",
            "河南省/平顶山市/汝州市",
            "河南省/安阳市",
            "河南省/安阳市/文峰区",
            "河南省/安阳市/北关区",
            "河南省/安阳市/殷都区",
            "河南省/安阳市/龙安区",
            "河南省/安阳市/安阳县",
            "河南省/安阳市/汤阴县",
            "河南省/安阳市/滑县",
            "河南省/安阳市/内黄县",
            "河南省/安阳市/安阳高新技术产业开发区",
            "河南省/安阳市/林州市",
            "河南省/鹤壁市",
            "河南省/鹤壁市/鹤山区",
            "河南省/鹤壁市/山城区",
            "河南省/鹤壁市/淇滨区",
            "河南省/鹤壁市/浚县",
            "河南省/鹤壁市/淇县",
            "河南省/鹤壁市/鹤壁经济技术开发区",
            "河南省/新乡市",
            "河南省/新乡市/红旗区",
            "河南省/新乡市/卫滨区",
            "河南省/新乡市/凤泉区",
            "河南省/新乡市/牧野区",
            "河南省/新乡市/新乡县",
            "河南省/新乡市/获嘉县",
            "河南省/新乡市/原阳县",
            "河南省/新乡市/延津县",
            "河南省/新乡市/封丘县",
            "河南省/新乡市/新乡高新技术产业开发区",
            "河南省/新乡市/新乡经济技术开发区",
            "河南省/新乡市/新乡市平原城乡一体化示范区",
            "河南省/新乡市/卫辉市",
            "河南省/新乡市/辉县市",
            "河南省/新乡市/长垣市",
            "河南省/焦作市",
            "河南省/焦作市/解放区",
            "河南省/焦作市/中站区",
            "河南省/焦作市/马村区",
            "河南省/焦作市/山阳区",
            "河南省/焦作市/修武县",
            "河南省/焦作市/博爱县",
            "河南省/焦作市/武陟县",
            "河南省/焦作市/温县",
            "河南省/焦作市/焦作城乡一体化示范区",
            "河南省/焦作市/沁阳市",
            "河南省/焦作市/孟州市",
            "河南省/濮阳市",
            "河南省/濮阳市/华龙区",
            "河南省/濮阳市/清丰县",
            "河南省/濮阳市/南乐县",
            "河南省/濮阳市/范县",
            "河南省/濮阳市/台前县",
            "河南省/濮阳市/濮阳县",
            "河南省/濮阳市/河南濮阳工业园区",
            "河南省/濮阳市/濮阳经济技术开发区",
            "河南省/许昌市",
            "河南省/许昌市/魏都区",
            "河南省/许昌市/建安区",
            "河南省/许昌市/鄢陵县",
            "河南省/许昌市/襄城县",
            "河南省/许昌市/许昌经济技术开发区",
            "河南省/许昌市/禹州市",
            "河南省/许昌市/长葛市",
            "河南省/漯河市",
            "河南省/漯河市/源汇区",
            "河南省/漯河市/郾城区",
            "河南省/漯河市/召陵区",
            "河南省/漯河市/舞阳县",
            "河南省/漯河市/临颍县",
            "河南省/漯河市/漯河经济技术开发区",
            "河南省/三门峡市",
            "河南省/三门峡市/湖滨区",
            "河南省/三门峡市/陕州区",
            "河南省/三门峡市/渑池县",
            "河南省/三门峡市/卢氏县",
            "河南省/三门峡市/河南三门峡经济开发区",
            "河南省/三门峡市/义马市",
            "河南省/三门峡市/灵宝市",
            "河南省/南阳市",
            "河南省/南阳市/宛城区",
            "河南省/南阳市/卧龙区",
            "河南省/南阳市/南召县",
            "河南省/南阳市/方城县",
            "河南省/南阳市/西峡县",
            "河南省/南阳市/镇平县",
            "河南省/南阳市/内乡县",
            "河南省/南阳市/淅川县",
            "河南省/南阳市/社旗县",
            "河南省/南阳市/唐河县",
            "河南省/南阳市/新野县",
            "河南省/南阳市/桐柏县",
            "河南省/南阳市/南阳高新技术产业开发区",
            "河南省/南阳市/南阳市城乡一体化示范区",
            "河南省/南阳市/邓州市",
            "河南省/商丘市",
            "河南省/商丘市/梁园区",
            "河南省/商丘市/睢阳区",
            "河南省/商丘市/民权县",
            "河南省/商丘市/睢县",
            "河南省/商丘市/宁陵县",
            "河南省/商丘市/柘城县",
            "河南省/商丘市/虞城县",
            "河南省/商丘市/夏邑县",
            "河南省/商丘市/豫东综合物流产业聚集区",
            "河南省/商丘市/河南商丘经济开发区",
            "河南省/商丘市/永城市",
            "河南省/信阳市",
            "河南省/信阳市/浉河区",
            "河南省/信阳市/平桥区",
            "河南省/信阳市/罗山县",
            "河南省/信阳市/光山县",
            "河南省/信阳市/新县",
            "河南省/信阳市/商城县",
            "河南省/信阳市/固始县",
            "河南省/信阳市/潢川县",
            "河南省/信阳市/淮滨县",
            "河南省/信阳市/息县",
            "河南省/信阳市/信阳高新技术产业开发区",
            "河南省/周口市",
            "河南省/周口市/川汇区",
            "河南省/周口市/淮阳区",
            "河南省/周口市/扶沟县",
            "河南省/周口市/西华县",
            "河南省/周口市/商水县",
            "河南省/周口市/沈丘县",
            "河南省/周口市/郸城县",
            "河南省/周口市/太康县",
            "河南省/周口市/鹿邑县",
            "河南省/周口市/河南周口经济开发区",
            "河南省/周口市/项城市",
            "河南省/驻马店市",
            "河南省/驻马店市/驿城区",
            "河南省/驻马店市/西平县",
            "河南省/驻马店市/上蔡县",
            "河南省/驻马店市/平舆县",
            "河南省/驻马店市/正阳县",
            "河南省/驻马店市/确山县",
            "河南省/驻马店市/泌阳县",
            "河南省/驻马店市/汝南县",
            "河南省/驻马店市/遂平县",
            "河南省/驻马店市/新蔡县",
            "河南省/驻马店市/河南驻马店经济开发区",
            "河南省/省直辖县级行政区划",
            "河南省/省直辖县级行政区划/济源市"
        ], $res);
    }

    /**
     * @covers \XiaoHua\Area\AreaFacade::format
     */
    public function testFormat()
    {
        $res = AreaFacade::format(110119);
        $this->assertEquals("北京 北京市 延庆区", $res);
    }

    /**
     * @covers \XiaoHua\Area\AreaFacade::byType
     */
    public function testGetAreaByType()
    {
        $res = AreaFacade::byType(2, function ($area) {
            return [
                'id' => $area['id'],
                'name' => $area['name']
            ];
        });

        $this->assertEquals([
            [
                "id" => 110000,
                "name" => "北京市"
            ], [
                "id" => 120000,
                "name" => "天津市"
            ], [
                "id" => 130000,
                "name" => "河北省"
            ], [
                "id" => 140000,
                "name" => "山西省"
            ], [
                "id" => 150000,
                "name" => "内蒙古自治区"
            ], [
                "id" => 210000,
                "name" => "辽宁省"
            ], [
                "id" => 220000,
                "name" => "吉林省"
            ], [
                "id" => 230000,
                "name" => "黑龙江省"
            ], [
                "id" => 310000,
                "name" => "上海市"
            ], [
                "id" => 320000,
                "name" => "江苏省"
            ], [
                "id" => 330000,
                "name" => "浙江省"
            ], [
                "id" => 340000,
                "name" => "安徽省"
            ], [
                "id" => 350000,
                "name" => "福建省"
            ], [
                "id" => 360000,
                "name" => "江西省"
            ], [
                "id" => 370000,
                "name" => "山东省"
            ], [
                "id" => 410000,
                "name" => "河南省"
            ], [
                "id" => 420000,
                "name" => "湖北省"
            ], [
                "id" => 430000,
                "name" => "湖南省"
            ], [
                "id" => 440000,
                "name" => "广东省"
            ], [
                "id" => 450000,
                "name" => "广西壮族自治区"
            ], [
                "id" => 460000,
                "name" => "海南省"
            ], [
                "id" => 500000,
                "name" => "重庆市"
            ], [
                "id" => 510000,
                "name" => "四川省"
            ], [
                "id" => 520000,
                "name" => "贵州省"
            ], [
                "id" => 530000,
                "name" => "云南省"
            ], [
                "id" => 540000,
                "name" => "西藏自治区"
            ], [
                "id" => 610000,
                "name" => "陕西省"
            ], [
                "id" => 620000,
                "name" => "甘肃省"
            ], [
                "id" => 630000,
                "name" => "青海省"
            ], [
                "id" => 640000,
                "name" => "宁夏回族自治区"
            ], [
                "id" => 650000,
                "name" => "新疆维吾尔自治区"
            ]
        ], $res);
    }

    /**
     * @covers \XiaoHua\Area\AreaFacade::parentOfType
     */
    public function testGetParentOfType()
    {
        $res = AreaFacade::parentOfType(110119, 3);
        $this->assertEquals(110100, $res);
    }
}